public class Student_review {
    public static void main(String[] args) {
        System.out.println("==================================================================================" +
                "=====================================");
        System.out.println("\n\t\tОтзыв по дисциплине курса:" +
                " \"Язык программирования Java для разработки приложений под Android.\n");
        System.out.println("\tДобрый день! Содержание курса понравилось, очень продуктивное обучение. " +
                "Много нужной информации, все очень доступно. \nВся программа составлена доходчиво, понятно." +
                "  Учиться можно в нужное для себя время, не прерывая трудовую деятельность. \nОбучение удобное, " +
                "позволяет сохранять себе информацию для последующего использования в работе. Сроки обучения приемлемы. " +
                "\nСпасибо за очень доступный, интересный курс обучения. \n\tОтдельное спасибо преподавателю - Елене Анатольевне!" +
                " Профессионал своего дела, очень правильно преподносит материал \nс учетом всех требований к программе и " +
                "с вниманием к каждому студенту! Полная преподавательская отдача! \n" +
                "После пройденного курса появилось ощущение, что обучение — это интересно, увлекательно, радостно, " +
                "а не только полезно!!!\n");
        System.out.println("\tС наилучшими пожеланиями, \n\tЮрченко Максим Юрьевич");
        System.out.println("\n==================================================================================" +
                "=====================================");

    }

    //Добрый день! Содержание курса понравилось, очень продуктивное обучение. Много нужной информации, все очень доступно. Вся программа составлена доходчиво, понятно.  Учиться можно в нужное для себя время, не прерывая трудовую деятельность. Обучение удобное, позволяет сохранять себе информацию для последующего использования в работе. Сроки обучения приемлемы. Спасибо за очень доступный, интересный курс обучения.
    //	Отдельное спасибо преподавателю - Елене Анатольевне! Профессионал своего дела, очень правильно преподносит материал. Уделяет  внимание каждому студенту! Полная преподавательская отдача!
    //После пройденного курса появилось ощущение, что обучение — это интересно, увлекательно, радостно, а не только полезно!!!
    //
    //  С наилучшими пожеланиями,
    //	Юрченко Максим Юрьевич
}
